<?php

// В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. 
// Необходимо представить пункты меню как элементы массива и вывести их циклом. 
// Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.

$mainMenu = [
    'Новости' => '#',
    'Каталог' => ['Бытовая техника' => '#', 'Компьютерная техника' => '#', 'Мобильные телефоны и гаджеты' => '#'],
    'О компании' => '#',
    'Контакты' => '#'
  ];
  createMenu($mainMenu, 'Главное меню');
  function createMenu($mainMenu, $name){
    echo "<ul>$name";
    foreach ($mainMenu as $key => $val){
      if(is_array($val)) {
        createMenu($val, $key);
        continue;
      }
      echo "<a href='$val'> <li>$key</li> </a>";
    }
    echo  '</ul>';
  }