<?php

/* Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания
(аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах). */

echo urlStyle('Жизнь моя жестянка');

function urlStyle($string) {


function replacement($string)
    {
    $replace = array(
        "А"=>"A","а"=>"a",
        "Б"=>"B","б"=>"b",
        "В"=>"V","в"=>"v",
        "Г"=>"G","г"=>"g",
        "Д"=>"D","д"=>"d",
        "Е"=>"E","е"=>"e",
        "Ё"=>"E","ё"=>"e",
        "Ж"=>"Zh","ж"=>"zh",
        "З"=>"Z","з"=>"z",
        "И"=>"I","и"=>"i",
        "Й"=>"I","й"=>"i",
        "К"=>"K","к"=>"k",
        "Л"=>"L","л"=>"l",
        "М"=>"M","м"=>"m",
        "Н"=>"N","н"=>"n",
        "О"=>"O","о"=>"o",
        "П"=>"P","п"=>"p",
        "Р"=>"R","р"=>"r",
        "С"=>"S","с"=>"s",
        "Т"=>"T","т"=>"t",
        "У"=>"U","у"=>"u",
        "Ф"=>"F","ф"=>"f",
        "Х"=>"Kh","х"=>"kh",
        "Ц"=>"Tc","ц"=>"tc",
        "Ч"=>"Ch","ч"=>"ch",
        "Ш"=>"Sh","ш"=>"sh",
        "Щ"=>"Shch","щ"=>"shch",
        "ь"=>"'","ы"=>"y","ъ"=>"",
        "Э"=>"E","э"=>"e",
        "Ю"=>"Iu","ю"=>"iu",
        "Я"=>"Ia","я"=>"ia");
    return strtr ($string, $replace);
    }

function replaceSpaces($string, $underscore = '_') {
    $array = explode(' ', $string);
    return implode($underscore, $array);
    }

    $string = replacement($string);
    $string = replaceSpaces($string);

    return $string;
}